const { Component } = wp.element;
import { abutSite } from './styled';
class Edit extends Component {
	render() {
		return (
			<div>
				<div className={ abutSite[ 'about-site' ] }>
					<div className={ abutSite[ 'about-site__left' ] }>
						<div className={ abutSite[ 'left__text-block' ] }>
							<div className={ `${ abutSite.left__circle }  ${ abutSite[ '-car' ] }` }>
								<svg
									xmlns="http://www.w3.org/2000/svg"
									width="38px"
									height="30px">
									<path
										fillRule="evenodd"
										fill="rgb(255, 255, 255)"
										d="M37.375,10.500 C37.375,9.263 36.363,8.250 35.125,8.250 L32.737,8.250 L30.769,2.907 C30.483,2.133 29.616,1.269 28.840,0.987 C28.840,0.987 26.125,0.000 19.000,0.000 C11.875,0.000 9.160,0.987 9.160,0.987 C8.384,1.269 7.517,2.133 7.231,2.908 L5.263,8.250 L2.875,8.250 C1.637,8.250 0.625,9.263 0.625,10.500 C0.625,11.738 1.637,12.750 2.875,12.750 L3.605,12.750 L3.019,14.343 C2.733,15.117 2.500,16.425 2.500,17.250 L2.500,27.000 C2.500,28.650 3.850,30.000 5.500,30.000 C7.150,30.000 8.500,28.650 8.500,27.000 L8.500,25.500 L29.500,25.500 L29.500,27.000 C29.500,28.650 30.850,30.000 32.500,30.000 C34.150,30.000 35.500,28.650 35.500,27.000 L35.500,17.250 C35.500,16.425 35.267,15.117 34.981,14.343 L34.395,12.750 L35.125,12.750 C36.363,12.750 37.375,11.738 37.375,10.500 ZM10.375,3.750 L27.625,3.750 L29.875,10.500 L8.125,10.500 L10.375,3.750 ZM7.750,19.500 C6.508,19.500 5.500,18.492 5.500,17.250 C5.500,16.008 6.508,15.000 7.750,15.000 C8.992,15.000 10.000,16.008 10.000,17.250 C10.000,18.492 8.992,19.500 7.750,19.500 ZM30.250,19.500 C29.007,19.500 28.000,18.493 28.000,17.250 C28.000,16.007 29.007,15.000 30.250,15.000 C31.493,15.000 32.500,16.007 32.500,17.250 C32.500,18.493 31.493,19.500 30.250,19.500 Z"
									/>
								</svg>
							</div>
							<div className={ abutSite.left__rectangle }>
								<div className={ abutSite.rectangle__title }>
                  import
									<br />
                  samochodów z usa
								</div>
								<div className={ abutSite.rectangle__text }>
                  Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed
                  do eiusmod Lorem ipsum dolor sit amet, consectetur adipisicing
                  elit, sed do eiusmod
								</div>
							</div>
						</div>
						<div className={ abutSite[ 'left__text-block' ] }>
							<div
								className={ `${ abutSite.left__circle }  ${ abutSite[ '-bicycle' ] }` }>
								<svg
									xmlns="http://www.w3.org/2000/svg"
									width="44px"
									height="27px">
									<path
										fillRule="evenodd"
										fill="rgb(255, 255, 255)"
										d="M36.816,12.600 C36.475,12.600 36.142,12.632 35.814,12.678 L35.077,10.517 C35.642,10.412 36.221,10.350 36.816,10.350 L38.612,10.350 C38.612,7.650 35.918,4.950 33.225,4.950 L32.386,2.617 C31.878,1.125 30.308,-0.000 28.735,-0.000 L26.939,-0.000 C26.195,-0.000 25.592,0.604 25.592,1.350 C25.592,2.096 26.195,2.700 26.939,2.700 L28.735,2.700 C29.147,2.700 29.703,3.099 29.836,3.489 L30.334,4.950 L22.449,4.950 C20.692,4.950 18.940,6.102 17.930,7.650 L5.388,7.650 C2.694,7.650 -0.000,10.350 -0.000,13.050 C1.838,11.382 4.378,10.350 7.184,10.350 C11.933,10.350 15.850,13.873 16.505,18.450 L14.237,18.450 C13.606,15.120 10.691,12.600 7.184,12.600 C3.216,12.600 -0.000,15.824 -0.000,19.800 C-0.000,23.776 3.216,27.000 7.184,27.000 C10.691,27.000 13.606,24.480 14.237,21.150 L27.388,21.150 L27.388,19.800 C27.388,16.131 29.479,12.956 32.528,11.391 L33.263,13.547 C31.096,14.787 29.633,17.121 29.633,19.800 C29.633,23.776 32.849,27.000 36.816,27.000 C40.784,27.000 44.000,23.776 44.000,19.800 C44.000,15.824 40.784,12.600 36.816,12.600 ZM7.184,24.300 C4.708,24.300 2.694,22.281 2.694,19.800 C2.694,17.319 4.708,15.300 7.184,15.300 C9.190,15.300 10.893,16.626 11.466,18.450 L7.184,18.450 C6.440,18.450 5.837,19.054 5.837,19.800 C5.837,20.546 6.440,21.150 7.184,21.150 L11.466,21.150 C10.893,22.974 9.190,24.300 7.184,24.300 ZM36.816,24.300 C34.341,24.300 32.327,22.281 32.327,19.800 C32.327,18.316 33.051,17.001 34.160,16.181 L35.542,20.237 C35.733,20.797 36.256,21.151 36.816,21.151 C36.960,21.151 37.107,21.127 37.252,21.078 C37.955,20.837 38.331,20.070 38.091,19.364 L36.709,15.305 C36.744,15.305 36.780,15.300 36.816,15.300 C39.292,15.300 41.306,17.319 41.306,19.800 C41.306,22.281 39.292,24.300 36.816,24.300 Z"
									/>
								</svg>
							</div>
							<div className={ abutSite.left__rectangle }>
								<div className={ abutSite.rectangle__title }>
                  import
									<br />
                  motocykli z usa
								</div>
								<div className={ abutSite.rectangle__text }>
                  Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed
                  do eiusmod Lorem ipsum dolor sit amet, consectetur adipisicing
                  elit, sed do eiusmod
								</div>
							</div>
						</div>
						<div className={ abutSite[ 'left__text-block' ] }>
							<div
								className={ `${ abutSite.left__circle }  ${ abutSite[ '-vehicle' ] }` }>
								<svg
									xmlns="http://www.w3.org/2000/svg"
									width="43px"
									height="37px">
									<path
										fillRule="evenodd"
										fill="rgb(255, 255, 255)"
										d="M32.457,19.357 C26.916,23.067 22.259,25.600 19.374,27.057 C19.995,27.261 20.683,27.379 21.410,27.379 C22.311,27.379 23.212,27.171 24.044,26.824 C24.874,26.407 25.774,26.201 26.745,26.201 C27.714,26.201 28.614,26.408 29.447,26.824 C30.277,27.171 31.178,27.379 32.079,27.379 C33.050,27.379 33.949,27.171 34.711,26.824 C35.542,26.407 36.444,26.201 37.413,26.201 C38.382,26.201 39.354,26.407 40.111,26.824 C40.942,27.171 41.844,27.379 42.813,27.379 L42.813,31.333 C41.845,31.333 40.944,31.124 40.111,30.779 C39.353,30.361 38.380,30.154 37.410,30.154 C36.441,30.154 35.540,30.362 34.708,30.779 C33.947,31.125 33.048,31.333 32.077,31.333 C31.176,31.333 30.275,31.124 29.444,30.779 C28.613,30.361 27.713,30.154 26.743,30.154 C25.772,30.154 24.872,30.362 24.040,30.779 C23.211,31.125 22.309,31.333 21.407,31.333 C20.438,31.333 19.538,31.124 18.775,30.779 C17.944,30.361 16.974,30.154 16.005,30.154 C15.103,30.154 14.135,30.362 13.302,30.779 C12.540,31.125 11.639,31.333 10.670,31.333 C9.769,31.333 8.868,31.124 8.037,30.779 C7.206,30.361 6.304,30.154 5.335,30.154 C4.364,30.154 3.464,30.362 2.632,30.779 C1.802,31.125 0.900,31.333 -0.000,31.333 L-0.000,27.379 C0.900,27.379 1.802,27.171 2.632,26.824 C3.463,26.408 4.364,26.202 5.335,26.202 C6.303,26.202 7.205,26.408 8.036,26.824 C8.867,27.172 9.768,27.380 10.669,27.380 C11.352,27.380 11.996,27.273 12.587,27.089 C12.890,25.812 13.486,23.497 13.925,22.956 C14.143,22.689 15.360,21.893 16.836,20.980 L16.841,16.165 L12.007,14.876 C12.007,14.876 10.053,14.358 10.062,12.438 L10.087,8.172 C10.087,8.172 10.038,4.953 12.170,4.585 C14.313,4.213 14.311,6.454 14.311,6.454 L14.296,7.834 L17.877,7.836 C18.473,7.835 18.987,8.312 18.988,8.906 C18.987,9.501 18.472,9.978 17.876,9.978 L14.273,9.978 L14.252,11.918 L18.569,13.121 C18.569,13.121 20.137,13.613 19.904,15.051 L19.556,19.331 C21.481,18.180 23.156,17.209 23.156,17.209 L23.113,13.299 C23.113,13.299 27.611,10.528 29.696,9.724 C30.672,9.347 31.657,9.067 32.629,8.849 C31.162,8.051 28.848,7.244 25.598,7.406 C23.079,7.527 21.169,8.540 21.151,8.550 C20.579,8.857 19.869,8.645 19.561,8.075 C19.253,7.505 19.462,6.795 20.030,6.485 C20.125,6.432 22.405,5.207 25.484,5.059 C31.488,4.768 34.900,7.368 35.954,8.335 C39.918,7.991 43.000,8.589 43.000,8.589 C43.000,8.589 42.113,12.887 32.457,19.357 ZM15.175,3.913 C14.174,4.480 12.913,4.098 12.350,3.098 C11.784,2.095 12.128,0.854 13.129,0.287 C14.128,-0.279 15.403,0.047 15.970,1.049 C16.535,2.050 16.173,3.349 15.175,3.913 ZM5.338,31.863 C6.307,31.863 7.208,32.071 8.040,32.488 C8.871,32.835 9.772,33.043 10.673,33.043 C11.643,33.043 12.543,32.835 13.305,32.488 C14.138,32.071 15.106,31.863 16.008,31.863 C16.977,31.863 17.947,32.071 18.778,32.488 C19.542,32.835 20.441,33.043 21.410,33.043 C22.312,33.043 23.214,32.835 24.044,32.488 C24.875,32.071 25.775,31.863 26.745,31.863 C27.715,31.863 28.616,32.071 29.447,32.488 C30.278,32.835 31.179,33.043 32.079,33.043 C33.051,33.043 33.950,32.835 34.711,32.488 C35.543,32.071 36.445,31.863 37.413,31.863 C38.383,31.863 39.355,32.071 40.114,32.488 C40.947,32.835 41.847,33.043 42.816,33.043 L42.816,36.997 C41.847,36.998 40.947,36.791 40.114,36.442 C39.354,36.025 38.382,35.817 37.413,35.817 C36.444,35.817 35.542,36.025 34.711,36.442 C33.949,36.790 33.050,36.997 32.079,36.997 C31.178,36.997 30.277,36.790 29.447,36.442 C28.614,36.025 27.714,35.817 26.745,35.817 C25.774,35.817 24.874,36.025 24.044,36.442 C23.212,36.790 22.311,36.997 21.410,36.997 C20.441,36.997 19.542,36.790 18.778,36.442 C17.947,36.025 16.977,35.817 16.008,35.817 C15.107,35.817 14.138,36.025 13.305,36.442 C12.543,36.790 11.643,36.997 10.673,36.997 C9.772,36.997 8.871,36.790 8.040,36.442 C7.208,36.025 6.307,35.817 5.338,35.817 C4.367,35.817 3.467,36.025 2.635,36.442 C1.805,36.790 0.903,36.997 0.003,36.997 L0.003,33.043 C0.903,33.043 1.805,32.835 2.635,32.488 C3.467,32.071 4.367,31.863 5.338,31.863 Z"
									/>
								</svg>
							</div>
							<div className={ abutSite.left__rectangle }>
								<div className={ abutSite.rectangle__title }>
                  import
									<br />
                  pojazdów z usa
								</div>
								<div className={ abutSite.rectangle__text }>
                  Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed
                  do eiusmod Lorem ipsum dolor sit amet, consectetur adipisicing
                  elit, sed do eiusmod
								</div>
							</div>
						</div>
					</div>
					<div className={ abutSite[ 'about-site__right' ] }>
						<div className={ abutSite.right__title }>
              Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do
              eiusmod tempor incididunt ut labore et
						</div>
						<div className={ abutSite[ 'right__text ' ] }>
							<b>
                Auta z USA | motocykle z USA | aukcje samochodów zabytkowych z
                USA
							</b>
							<br />
              Usa-auto-online - auta z licytacji USA Copart, Iaai, Manheim,
              samochody z ameryki. Na aukcjach dostępne samochody uszkodzone i
              powypadkowe od ubezpieczalni. Licytacje motocykli z USA oraz
              import ze stanów
						</div>
						<div className={ abutSite[ 'right__text ' ] }>
							<b>Serwis ogłoszeń aut z USA nr 1 w Polsce</b>
							<br />
              USA-AUTO-ONLINE udostępnia blisko 100 000 aukcji aut i motocykli z
              USA miesięcznie! Są to oferty wystawiane przez około 140 domów
              aukcyjnych w Stanach Zjednoczonych. Łączna liczba zaprezentowanych
              ofert aut z USA w zeszłym roku przekroczyła 1 000 000 pojazdów i
              samochodów, motocykli i innych. Już teraz zaawansowanie
              technologiczne naszego serwisu stawia go na pozycji numer 1 w
              Polsce. Wciąż jednak pracujemy nad rozwojem jakości naszych usług
              pracując na jeszcze większe zadowolenie naszych klientów!  Czytaj
              więcej
						</div>
						<div className={ abutSite[ 'right__text ' ] }>
							<b>
                USA-AUTO-ONLINE to serwis z ogłoszeniami aut z USA. W naszej
                ofercie:
							</b>
							<br />
              bardzo duży wybór samochodów z USA z ponad 170 domów aukcyjnych z
              USA. Każdego tygodnia na aukcjach jest oferowane ponad 40 000 aut.
              Fachowe doradztwo i pomoc w zakupie Pełna obsługa importu auta z
              usa, od zakupu, przez transport i odprawę celną, aż po
              dostarczenia pojazdu pod wskazany adres w Polsce. Kalkulator
              kosztów sprowadzenia auta z usa oraz transportu auta z usa
              (motocykli i samochodów zabytkowych z USA)
						</div>
					</div>
				</div>
			</div>
		);
	}
}

export default Edit;
